app/Models/MasterData/CategoryStatus.php

SELECT *
FROM `categorystatuses`
---
    public function getAllData()
    {
        return $this->findAll();