app/Models/MasterData/EmployeeStatus.php

SELECT *
FROM `employeestatuses`
---
    public function getAllData()
    {
        return $this->findAll();