app/Models/MasterData/UnitStatus.php

    public function getAllData()
    {
        return $this->findAll();
---
SELECT *
FROM `unitstatuses`