app/Models/MasterData/UserStatus.php

SELECT *
FROM `userstatuses`
---
    public function getAllData()
    {
        return $this->findAll();