app/Controllers/CategoryController.php

    public function store()
    {
        $data = [
            'category' => $this->request->getPost('category'),
            'description' => $this->request->getPost('description'),
            'status' => 1,
        ];
        $this->CategoryModel->insert($data);
---
INSERT INTO `categories` (`category`, `description`) VALUES ('teste', 'tessa')

    public function update($id)
    {
        $data = [
            'category' => $this->request->getPost('category'),
            'description' => $this->request->getPost('description'),
        ];
        $this->CategoryModel->update($id, $data);
---
UPDATE `categories` SET `category` = 'tes9', `description` = 'testing9'
WHERE `categories`.`id` IN ('8')

    public function delete($id)
    {
        $this->CategoryModel->delete($id);
---
DELETE FROM `categories`
WHERE `id` IN ('10')