app/Models/Category.php

SELECT `c`.*, `cs`.`status` AS `statusName`
FROM `categories` AS `c`
LEFT JOIN `categorystatuses` AS `cs` ON `c`.`status` = `cs`.`id`
---
    public function getAllData()
    {
        // return $this->findAll();

        $builder = $this->db->table('categories AS c');
        $builder->select('c.*, cs.status AS statusName');
        $builder->join('categorystatuses AS cs', 'c.status = cs.id', 'left');
        $data = $builder->get();