app/Models/Employee.php

SELECT *
FROM `employees`
---
    public function getAllData()
    {
        return $this->findAll();