app/Models/Unit.php

SELECT `u`.*, `us`.`status` AS `statusName`
FROM `units` AS `u`
LEFT JOIN `unitstatuses` AS `us` ON `u`.`status` = `us`.`id`
---
    public function getAllData()
    {
        // return $this->findAll();

        $builder = $this->db->table('units AS u');
        $builder->select('u.*, us.status AS statusName');
        $builder->join('unitstatuses AS us', 'u.status = us.id', 'left');
        $data = $builder->get();