app/Models/User.php

SELECT `u`.*, `us`.`status` AS `statusName`
FROM `users` AS `u`
LEFT JOIN `userstatuses` AS `us` ON `u`.`status` = `us`.`id`
---
    public function getAllData()
    {
        // return $this->findAll();

        $builder = $this->db->table('users AS u');
        $builder->select('u.*, us.status AS statusName');
        $builder->join('userstatuses AS us', 'u.status = us.id', 'left');
        $data = $builder->get();